# SEMINAR 2. TASK 1.
# Создайте несколько переменных разных типов.
# Проверьте, к какому типу относятся созданные переменные.

a = 11
b = 1.123
c = "Hallo"
d = [a, b, c]

print(a, type(a))
print(b, type(b))
print(c, type(c))
print(d, type(d))
